In [1]:
import pandas as pd

In [2]:
data = {
    'Nombre': ['Ana', 'Luis', 'Carlos', 'Sara'],
    'Edad': [25, 30, 22, 27],
    'Ciudad': ['Madrid', 'Barcelona', 'Valencia', 'Bilbao']
}

df = pd.DataFrame(data)

In [3]:
df

   Nombre  Edad     Ciudad
0     Ana    25     Madrid
1    Luis    30  Barcelona
2  Carlos    22   Valencia
3    Sara    27     Bilbao

Agregar una nueva columna

In [4]:
df['Salarios'] = [30000, 28000, 40000, 38000]
df

   Nombre  Edad     Ciudad  Salarios
0     Ana    25     Madrid     30000
1    Luis    30  Barcelona     28000
2  Carlos    22   Valencia     40000
3    Sara    27     Bilbao     38000

Editar toda una columna del DataFrame

In [6]:
df['Salarios'] = df['Salarios'] + 2000
df

   Nombre  Edad     Ciudad  Salarios
0     Ana    25     Madrid     32000
1    Luis    30  Barcelona     30000
2  Carlos    22   Valencia     42000
3    Sara    27     Bilbao     40000